# ZoomSheetSize Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UIView..::..ZoomSheetSize Method
UIView Class See Also
---
Zoom to the sheet size.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void ZoomSheetSize()
```

Visual Basic
---
```text
Public Sub ZoomSheetSize
```

Visual C++
---
```text
public:
void ZoomSheetSize()
```

# See Also
UIView Class
Autodesk.Revit.UI Namespace